DataProcessors/РасчетВестинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РасчетВестинга</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПакетОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетОпционов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОпционов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/РасчетВестинга/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура РассчитатьВестингКоманда(Команда)
    РассчитатьВестинг(ЭтотОбъект.Объект.ПакетОпционов, ЭтотОбъект.Объект.Дата);
КонецПроцедуры

Процедура РассчитатьВестинг(ПакетыОпционов, Дата)
    Если ПакетыОпционов = Неопределено Тогда
        Сообщить("Ошибка: Пакет опционов не выбран!");
        Возврат;
    КонецЕсли;
    // получение информации о пакете
    ДатаНачала = ПакетыОпционов.ДатаНачалаВестинга;
    Срок = ПакетыОпционов.СрокВестинга;
    Количество = ПакетыОпционов.КоличествоОпционов;

    ВсегоНачислено = 0;
    ЭтотОбъект.Объект.РасчетОпционов.Очистить();
	
	Если Дата = Неопределено Тогда
        Сообщить("Ошибка: необходимо указать дату расчета!");
        Возврат;
    КонецЕсли;

    // первое начисление через 12 месяцев
    ДатаРасчета = КонецМесяца(ДобавитьМесяц(ДатаНачала, 12));
    
    Если ДатаРасчета <= Дата Тогда
        НачисленныеОпционы = Окр((Количество * 1 / (Срок * 12))*12, 0);
        ВсегоНачислено = ВсегоНачислено + НачисленныеОпционы;
        //заполнение табличной части
        НоваяСтрока = ЭтотОбъект.Объект.РасчетОпционов.Добавить();
        НоваяСтрока.Дата = ДатаРасчета;
        НоваяСтрока.Количество = НачисленныеОпционы;
        НоваяСтрока.СуммаОпционов = ВсегоНачислено;
    Иначе
        Возврат;
    КонецЕсли;

    // последующие ежемесячные начисления
	Для i = 1 По (Срок * 12 - 12) Цикл
        ДатаРасчета = КонецМесяца(ДобавитьМесяц(ДатаРасчета, 1));

        Если ДатаРасчета > Дата Тогда
            Прервать;
        КонецЕсли;

        НачисленныеОпционы = Окр(Количество * 1 / (Срок * 12), 0);
		ВсегоНачислено = ВсегоНачислено + НачисленныеОпционы;
		
		Если ВсегоНачислено >= Количество Тогда    
			НачисленныеОпционы = ВсегоНачислено - Количество;
			ВсегоНачислено = Количество;  
		КонецЕсли;
        //заполнение табличной части
        НоваяСтрока = ЭтотОбъект.Объект.РасчетОпционов.Добавить();
        НоваяСтрока.Дата = ДатаРасчета;
        НоваяСтрока.Количество = НачисленныеОпционы;
        НоваяСтрока.СуммаОпционов = ВсегоНачислено;
    КонецЦикла;
    
    Сообщить("Рассчет вестинга завершен!");   
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.Объект.Дата=ТекущаяДата()
КонецПроцедуры
